In [113]:
import pandas as pd

Đọc dữ liệu từ Google Sheets vào DataFrame bằng pandas

In [114]:
google_sheet_id = '1VCkHwBjJGRJ21asd9pxW4_0z2PWuKhbLR3gUHm-p4GI'
url='https://docs.google.com/spreadsheets/d/' + google_sheet_id + '/export?format=xlsx'
df_enrollies_data = pd.read_excel(url)

In [115]:
df_enrollies_data.head()

   enrollee_id      full_name      city gender
0         8949     Mike Jones  city_103   Male
1        29725    Laura Jones   city_40   Male
2        11561   David Miller   city_21    NaN
3        33241    Laura Davis  city_115    NaN
4          666  Alex Martinez  city_162   Male

remove duplicate giữ lại dòng đầu tiên

In [116]:
df_enrollies_data = df_enrollies_data.drop_duplicates()

check info

In [117]:
df_enrollies_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   enrollee_id  19158 non-null  int64
 1   full_name    19158 non-null  object
 2   city         19158 non-null  object
 3   gender       14650 non-null  object
dtypes: int64(1), object(3)
memory usage: 598.8+ KB

In [118]:
df_enrollies_data['gender'].value_counts()

gender
Male      13221
Female     1238
Other       191
Name: count, dtype: int64

Fill NA bằng Unknown

In [119]:
df_enrollies_data['gender'].fillna('Unknown', inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_17148\545160970.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_enrollies_data['gender'].fillna('Unknown', inplace=True)

# Chuyển dtype

In [120]:

df_enrollies_data['full_name'] = df_enrollies_data['full_name'].astype('string')
df_enrollies_data['city'] = df_enrollies_data['city'].astype('category')
df_enrollies_data['gender'] = df_enrollies_data['gender'].astype('category')

In [121]:
df_enrollies_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   enrollee_id  19158 non-null  int64
 1   full_name    19158 non-null  string
 2   city         19158 non-null  category
 3   gender       19158 non-null  category
dtypes: category(2), int64(1), string(1)
memory usage: 342.1 KB

---

Import data Enrollies_education.xlsx

In [122]:
df_enrollies_education = pd.read_excel('Enrollies_education.xlsx')

In [123]:
df_enrollies_education.head()

   enrollee_id enrolled_university education_level major_discipline
0         8949       no_enrollment        Graduate             STEM
1        29725       no_enrollment        Graduate             STEM
2        11561    Full time course        Graduate             STEM
3        33241                 NaN        Graduate  Business Degree
4          666       no_enrollment         Masters             STEM

remove duplicate

In [124]:
df_enrollies_education.drop_duplicates(inplace=True)

In [125]:
df_enrollies_education.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          19158 non-null  int64
 1   enrolled_university  18772 non-null  object
 2   education_level      18698 non-null  object
 3   major_discipline     16345 non-null  object
dtypes: int64(1), object(3)
memory usage: 598.8+ KB

In [126]:
df_enrollies_education['enrolled_university'].value_counts()

enrolled_university
no_enrollment       13817
Full time course     3757
Part time course     1198
Name: count, dtype: int64

In [127]:
df_enrollies_education['enrolled_university'].fillna('Unknown', inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_17148\2271519027.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_enrollies_education['enrolled_university'].fillna('Unknown', inplace=True)

In [128]:
df_enrollies_education['education_level'].value_counts()

education_level
Graduate          11598
Masters            4361
High School        2017
Phd                 414
Primary School      308
Name: count, dtype: int64

In [129]:
df_enrollies_education['education_level'].fillna('Unknown', inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_17148\216482322.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_enrollies_education['education_level'].fillna('Unknown', inplace=True)

In [130]:
df_enrollies_education['major_discipline'].value_counts()

major_discipline
STEM               14492
Humanities           669
Other                381
Business Degree      327
Arts                 253
No Major             223
Name: count, dtype: int64

In [131]:
df_enrollies_education['major_discipline'].fillna('Unknown', inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_17148\2317808790.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_enrollies_education['major_discipline'].fillna('Unknown', inplace=True)

In [132]:


df_enrollies_education['enrolled_university'] = df_enrollies_education['enrolled_university'].astype('category')
df_enrollies_education['education_level'] = df_enrollies_education['education_level'].astype('category')
df_enrollies_education['major_discipline'] = df_enrollies_education['major_discipline'].astype('category')

In [133]:
df_enrollies_education.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          19158 non-null  int64
 1   enrolled_university  19158 non-null  category
 2   education_level      19158 non-null  category
 3   major_discipline     19158 non-null  category
dtypes: category(3), int64(1)
memory usage: 206.7 KB

---

In [134]:
df_work_experience = pd.read_csv('Work_experience.csv')
df_work_experience.head()

,enrollee_id,relevent_experience,experience,company_size,company_type,last_new_job
0,8949,Has relevent experience,>20,NaN,NaN,1
1,29725,No relevent experience,15,50-99,Pvt Ltd,>4
2,11561,No relevent experience,5,NaN,NaN,never
3,33241,No relevent experience,<1,NaN,Pvt Ltd,never
4,666,Has relevent experience,>20,50-99,Funded Startup,4

In [135]:
df_work_experience.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          19158 non-null  int64
 1   relevent_experience  19158 non-null  object
 2   experience           19093 non-null  object
 3   company_size         13220 non-null  object
 4   company_type         13018 non-null  object
 5   last_new_job         18735 non-null  object
dtypes: int64(1), object(5)
memory usage: 898.2+ KB

In [136]:
df_work_experience['experience'].fillna('Unknown', inplace=True)
df_work_experience['company_size'].fillna('Unknown', inplace=True)
df_work_experience['company_type'].fillna('Unknown', inplace=True)
df_work_experience['last_new_job'].fillna('Unknown', inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_17148\3150300335.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_work_experience['experience'].fillna('Unknown', inplace=True)
C:\Users\admin\AppData\Local\Temp\ipykernel_17148\3150300335.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_work_experience['company_size'].fillna('Unknown', inplace=True)
C:\Users\admin\AppData\Local\Temp\ipykernel_17148\3150300335.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_work_experience['company_type'].fillna('Unknown', inplace=True)
C:\Users\admin\AppData\Local\Temp\ipykernel_17148\3150300335.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_work_experience['last_new_job'].fillna('Unknown', inplace=True)

In [137]:
df_work_experience['relevent_experience'] = df_work_experience['relevent_experience'].astype('category')
df_work_experience['experience'] = df_work_experience['experience'].astype('category')
df_work_experience['company_size'] = df_work_experience['company_size'].astype('category')
df_work_experience['company_type'] = df_work_experience['company_type'].astype('category')
df_work_experience['last_new_job'] = df_work_experience['last_new_job'].astype('category')

In [138]:
df_work_experience.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   enrollee_id          19158 non-null  int64
 1   relevent_experience  19158 non-null  category
 2   experience           19158 non-null  category
 3   company_size         19158 non-null  category
 4   company_type         19158 non-null  category
 5   last_new_job         19158 non-null  category
dtypes: category(5), int64(1)
memory usage: 245.2 KB

In [139]:
!pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\admin\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (1.1.1)

[notice] A new release of pip is available: 25.0.1 -> 25.2
[notice] To update, run: C:\Users\admin\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [140]:
import pymysql

In [141]:
from sqlalchemy import create_engine

In [142]:
engine = create_engine('mysql+pymysql://etl_practice:550814@112.213.86.31:3360/company_course')

In [143]:
df_training_hours =  pd.read_sql_table('training_hours', con=engine)

In [144]:
df_training_hours.head()

   enrollee_id  training_hours
0         8949              36
1        29725              47
2        11561              83
3        33241              52
4          666               8

In [145]:
df_training_hours.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   enrollee_id     19158 non-null  int64
 1   training_hours  19158 non-null  int64
dtypes: int64(2)
memory usage: 299.5 KB

In [146]:
df_training_hours = df_training_hours.drop_duplicates()

---

In [147]:
df_employment =  pd.read_sql_table('employment', con=engine)

In [148]:
df_employment.head()

   enrollee_id  employed
0            1       0.0
1            2       1.0
2            4       0.0
3            5       0.0
4            7       0.0

---

In [149]:
tables = pd.read_html('https://sca-programming-school.github.io/city_development_index/index.html')
df_city_development_index = tables[0]
df_city_development_index.head()

       City  City Development Index
0  city_103                   0.920
1   city_40                   0.776
2   city_21                   0.624
3  city_115                   0.789
4  city_162                   0.767

In [150]:
df_city_development_index.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 123 entries, 0 to 122
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   City                    123 non-null    object
 1   City Development Index  123 non-null    float64
dtypes: float64(1), object(1)
memory usage: 2.1+ KB

In [152]:
import sqlite3
conn = sqlite3.connect('hr_enrollies_data.db')
# Push all DataFrames to the SQLite database
df_enrollies_data.to_sql('enrollies_data', conn, if_exists='replace', index=False)
df_enrollies_education.to_sql('enrollies_education', conn, if_exists='replace', index=False)
df_work_experience.to_sql('work_experience', conn, if_exists='replace', index=False)
df_training_hours.to_sql('training_hours', conn, if_exists='replace', index=False)
df_employment.to_sql('employment', conn, if_exists='replace', index=False)
df_city_development_index.to_sql('city_development_index', conn, if_exists='replace', index=False)

123